#include <iostream>
int main() {
    setlocale(LC_ALL, "Russian");
    std::cout << 
        "\t\t\tКлавиатуры Wyse KU-8933 двух ревизий\n\n"
        "\t\t\tЦена: 650руб\n"
        "\t\t\tКол-во: 6шт\n\n"
        "\t\t\tКлавиатуры Wyse двух ревизий(C и D), отличаются раскладками.\n"
        "\t\t\tКлавиатуры запылились, но исправно работают.Имеют дополнительный\n"
        "\t\t\tпорт PS / 2 на правом боку для подключения мыши(3е фото).Есть кабель-\n"
        "\t\t\tканалы.\n\n"
        "\t\t\tИнтерфейс подключения: USB.\n\n"
        "\t\t\tКлавиатуры являются аналогом IBM KB-8923 или же Chicony KB-5923.\n\n"
        "\t\t\tЦена за штуку - 650 рублей.\n"
        "\t\t\tПри покупке всех 6 оптом отдам по 500.\n\n"
        "\t\t\tОтправлю Авито Доставкой.\n";
}