#include <iostream>
using namespace std;

void z1() {
    double r1, r2, r3;

    cout << "---------- Задание 1 ----------\n";

    cout << "Введите первое сопротивление: ";
    cin >> r1;
    cout << "Введите второе сопротивление: ";
    cin >> r2;
    cout << "Введите третье сопротивление: ";
    cin >> r3;

    cout << "\nОбщее сопротивление: " 
        << 1 / r1 + 1 / r2 + 1 / r3 
        << "\n-------------------------------\n\n";
}

void z2() {
    double S, L, R;

    cout << "---------- Задание 2 ----------\n";

    cout << "Введите длину: ";
    cin >> L;

    R = L / (2 * 3.14);
    S = 3.14 * R * R;

    cout << "\nПлощадь круга: " 
         << S 
         << "\n-------------------------------\n\n";
}

void z3() {
    double V, T, A;

    cout << "---------- Задание 2 ----------\n";

    cout << "Введите скорость: ";
    cin >> V;
    cout << "Введите время: ";
    cin >> T;
    cout << "Введите ускорение: ";
    cin >> A;

    cout << "Расстояние: " 
         << V * T + (A * T * T) / 2 
         << "\n-------------------------------\n\n";
}

int main() {
    setlocale(LC_ALL, "Russian");
    z1();
    z2();
    z3();
    return 0;
}
    
